In [267]:
import pandas as pd

In [268]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['Id', 'Salary']).astype({'Id':'Int64', 'Salary':'Int64'})

In [269]:
employee['rank'] = employee['Salary'].rank(method='dense',ascending=False)
employee

   Id  Salary  rank
0   1     100   3.0
1   2     200   2.0
2   3     300   1.0

In [270]:
def Nth_Highest_Salary(n):
    Ns = employee['rank']
    if n in Ns.values:
        result = employee[employee['rank']==n]
        return result
    else:
        return pd.DataFrame([None],columns=[None])

In [271]:
Nth_Highest_Salary(3)

   Id  Salary  rank
0   1     100   3.0

In [272]:
Nth_Highest_Salary(4)

   None
0  None

In [273]:
Nth_Highest_Salary(1)

   Id  Salary  rank
2   3     300   1.0